Tekla Open API Reference for Tekla Structures 2025
AnalysisModel.Select Method (Boolean)
 Selects an analysis model. The AnalysisModelName or ID has to be set.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Select(
	bool update
)
Public Function Select (
	update As Boolean
) As Boolean
Parameters
update
Type: System.Boolean
Indicates whether analysis model is updated.
Return Value
Type: Boolean
True if successful.
See Also
Reference
AnalysisModel Class
Select Overload
Tekla.Structures.Analysis Namespace